providers/ultradns-ws/src/test/resources/update_rr.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v01="http://webservice.api.ultra.neustar.com/v01/"><soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:UsernameToken><wsse:Username>identity</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">credential</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><v01:updateResourceRecord><transactionID /><resourceRecord Guid="04053D8E57C7931F" ZoneName="jclouds.org." Type="15" DName="mail.jclouds.org." TTL="1800"><InfoValues Info1Value="10" Info2Value="maileast.jclouds.org." /></resourceRecord></v01:updateResourceRecord></soapenv:Body></soapenv:Envelope>